tap "felixkratz/formulae"
tap "nikitabobko/tap"
brew "ca-certificates"
brew "xz"
brew "awscli"
brew "bash"
brew "bat"
brew "bind"
brew "cliclick"
brew "composer"
brew "coursier"
brew "ctags"
brew "docker"
brew "fd"
brew "fzf"
brew "gh"
brew "ghcup"
brew "git-delta"
brew "git-lfs"
brew "glow"
brew "gum"
brew "helm"
brew "htop"
brew "ijq"
brew "jq"
brew "k9s"
brew "kubectx"
brew "kubernetes-cli"
brew "luarocks"
brew "tree-sitter"
brew "neovim"
brew "nvm"
brew "podman"
brew "pyenv"
brew "ripgrep"
brew "shfmt"
brew "tfenv"
brew "tldr"
brew "tmux"
brew "tree"
brew "tree-sitter-cli"
brew "yq"
brew "zoxide"
brew "felixkratz/formulae/borders"
cask "nikitabobko/tap/aerospace"
cask "dmenu-mac"
cask "hiddenbar"
cask "karabiner-elements"
cask "kitty"
go "golang.org/x/tools/gopls"
npm "neovim"
npm "prettier"
